Revit 2024 API
SelectionUIOptions.ActivateControlsAndDimensionsOnMultiSelect Property
 Indicates whether controls and temporary dimensions are activated on selection of multiple elements.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool ActivateControlsAndDimensionsOnMultiSelect { get; set; }
Visual Basic
Public Property ActivateControlsAndDimensionsOnMultiSelect As Boolean
	Get
	Set
Visual C++
public:
property bool ActivateControlsAndDimensionsOnMultiSelect {
	bool get ();
	void set (bool value);
}
Remarks
 Revit always shows certain controls and temporary dimensions for a single selected element When this option is set Revit also shows these controls and dimensions when multiple elements are selected. Note that this setting takes effect on the next selection change. To have this change take effect immediately use
CopyC#
Selection.SetElementIds(Selection.GetElementIds());
See Also
SelectionUIOptions Class
Autodesk.Revit.UI Namespace